DO NOT CHANGE THE VARIABLE NAMES

Set the precision of our dataframes to one decimal place.
pd.set_option('precision', 1)

Create a Pandas DataFrame that contains the ratings some users have given to a series of books. 

The ratings given are in the range from 1 to 5, with 5 being the best score. 

The names of the books, the corresponding authors, and the ratings of each user are given below:

`books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])`

`authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])`


User ratings are in the order of the book titles mentioned above
If a user has not rated all books, Pandas will automatically consider the missing values as NaN.

If a user has mentioned `np.nan` value, then also it means that the user has not yet rated that book.

`user_1 = pd.Series(data = [3.2, np.nan ,2.5])`

`user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])`

`user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])`

`user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])`


Use the data above to create a Pandas DataFrame that has the following column
labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. 
Let Pandas automatically assign numerical row indices to the DataFrame. 

TO DO: Create a dictionary with the data given above

`dat` = 

TO DO: Create a Pandas DataFrame using the dictionary created above

`book_ratings` = 

# TO DO:
If you created the dictionary correctly you should have a Pandas DataFrame that has column labels: 
'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4' and row indices 0 through 4.

Now replace all the NaN values in your DataFrame with the average rating in each column. Replace the NaN values in place. 

#### HINT: Use the `pandas.DataFrame.fillna(value, inplace = True)` function for substituting the NaN values. 

#### Write your code below:

In [1]:
import pandas as pd
import numpy as np

In [37]:

# DO NOT CHANGE THE VARIABLE NAMES

# Set the precision of our dataframes to one decimal place.
pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a series of books. 
# The ratings given are in the range from 1 to 5, with 5 being the best score. 
# The names of the books, the corresponding authors, and the ratings of each user are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

# User ratings are in the order of the book titles mentioned above
# If a user has not rated all books, Pandas will automatically consider the missing values as NaN.
# If a user has mentioned `np.nan` value, then also it means that the user has not yet rated that book.
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])


# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. 
# Let Pandas automatically assign numerical row indices to the DataFrame. 

# TO DO: Create a dictionary with the data given above
dat = {'Author': authors, 'Book Title': books, 'User 1': user_1, 'User 2': user_2, 'User 3': user_3, 'User 4': user_4}

# TO DO: Create a Pandas DataFrame using the dictionary created above
book_ratings = pd.DataFrame(dat)

# TO DO:
# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 
# 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4' 
# and row indices 0 through 4.

# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. 
# HINT: Use the `pandas.DataFrame.fillna(value, inplace = True)` function for substituting the NaN values. 
# Write your code below:

book_ratings.fillna(book_ratings.iloc[:, 2:].mean(axis=0), axis=0, inplace=True)

In [38]:
book_ratings

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     2.9     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     2.8     4.0
3          H. G. Wells     The Time Machine     2.9     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     2.9     3.5     2.8     4.2

In [36]:
book_ratings.iloc[:, 2:].mean()

User 1    2.9
User 2    3.5
User 3    2.8
User 4    4.1
dtype: float64

#### Level Up

From the DataFrame above can you now pick all the books that had a rating of 5?
Hint - You can do this in just one line of code, by using pandas.DataFrame.any. Try to do it yourself first, you'll find the answer below:

In [47]:
# Sol
high = book_ratings[(book_ratings == 5).any(axis=1)]['Book Title'].values
high

array(['Great Expectations', 'The Time Machine'], dtype=object)

In [48]:
# Explain:
# 1
best_rate = book_ratings[(book_ratings == 5)]

In [49]:
best_rate

  Author Book Title  User 1  User 2  User 3  User 4
0    NaN        NaN     NaN     5.0     NaN     NaN
1    NaN        NaN     NaN     NaN     NaN     NaN
2    NaN        NaN     NaN     NaN     NaN     NaN
3    NaN        NaN     NaN     NaN     NaN     5.0
4    NaN        NaN     NaN     NaN     NaN     NaN

In [53]:
# 2
best_rate.any(axis=1)

0     True
1    False
2    False
3     True
4    False
dtype: bool

In [57]:
# 3
best_rate = book_ratings[(book_ratings == 5).any(axis=1)]

In [58]:
best_rate

            Author          Book Title  User 1  User 2  User 3  User 4
0  Charles Dickens  Great Expectations     3.2     5.0     2.0     4.0
3      H. G. Wells    The Time Machine     2.9     3.8     4.0     5.0

In [60]:
best_rate['Book Title'].values

array(['Great Expectations', 'The Time Machine'], dtype=object)

In [68]:
best = book_ratings[(book_ratings == 5).any(axis=1)]['Book Title'].values

In [70]:
best

array(['Great Expectations', 'The Time Machine'], dtype=object)